[
    {
        "created": "20250525042337214",
        "title": "\n                     The Architecture of Mathematics – And How Developers Can Use it in Code \n                ",
        "text": "\n                     \"To understand is to perceive patterns.\" - Isaiah Berlin Math is not just numbers. It is the science of finding complex patterns that shape our world. This means that to truly understand it, we need to see beyond numbers, formulas, and theorems and ... \n                \n                     <blockquote>\n<p>\"To understand is to perceive patterns.\" - Isaiah Berlin</p>\n</blockquote>\n<p>Math is not just numbers. It is the science of finding complex patterns that shape our world. This means that to truly understand it, we need to see beyond numbers, formulas, and theorems and understand its structures.</p>\n<p>The main goal of this article is to show how math is just like a growing tree of ideas. I want to show that math is a living system of logic, not just formulas to memorize. With analogies, history, and code examples, I want to help you understand math more deeply and how you can apply it to programming.</p>\n<p>I’ve also included some code examples here to help you connect theory and practice. I show them to demonstrate how math ideas are applied to real problems. Whether you are new to more advanced math or are more experienced, these code examples will help you understand how to apply math in programming.</p>\n<p>This link across theory and application reflects my own studies. I am a finalist in an undergraduate degree in Electrical and Computer Engineering at NOVA FCT, one of the best engineering faculties in Portugal.</p>\n<p>My engineering degree is one with more math and physics. This is because it’s key to get a solid grasp of math to understand electronics, telecommunications, control theory, and other areas of engineering.</p>\n<p>Here’s a brief overview of some of the math and physics subjects I’ve learned:</p>\n<ul>\n<li><p><strong>Partial Differential Equations (PDEs):</strong> These equations model real-world phenomena, from heat diffusion to the economy of a country.</p>\n</li>\n<li><p><strong>Harmonic Analysis (Fourier &amp; Laplace):</strong> Integral transforms like the Fourier and Laplace transform allow us to understand problems in new domains.</p>\n</li>\n<li><p><strong>Complex Analysis:</strong> Extending calculus into the complex plane gives rise to powerful tools used in physics and engineering.</p>\n</li>\n<li><p><strong>Numerical Analysis:</strong> When analytical solutions are impossible or inefficient, numerical methods provide computer-based approximations. This is crucial for real-world applications.</p>\n</li>\n<li><p><strong>Control and Signal Theory:</strong> These areas show us how to design stable systems like rockets, trains, and robots.</p>\n</li>\n<li><p><strong>Physics:</strong> Courses in Classical Mechanics and Electromagnetism helped bridge theoretical math to physical laws</p>\n</li>\n</ul>\n<p>During my years of study, besides technical skills, I’ve developed a deeper understanding of how the world works and the structure of the field of mathematics. And I’ve started to find patterns in how math is a framework of interconnected logic.</p>\n<h3 id=\"heading-in-this-article-well-explore\">In this article, we’ll explore:</h3>\n<ul>\n<li><p><a class=\"post-section-overview\" href=\"#heading-simple-analogy-the-tree-of-mathematics\">Simple Analogy: The Tree of Mathematics</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-the-structure-and-history-of-mathematics\">The Structure and History of Mathematics</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-an-tree-example-foundations-of-relativity-by-albert-einstein\">An Tree example: Foundations of Relativity by Albert Einstein</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-the-biggest-paradox-of-math-discovered-by-kurt-godel\">The Biggest Paradox of Math, Discovered by Kurt Gödel</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-what-about-applied-math-and-engineering\">What About Applied Math and Engineering?</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-code-examples-analytical-and-numerical-approaches\">Code Examples – Analytical and Numerical Approaches</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-the-impact-of-a-grand-unified-theory-of-mathematics\">The Impact of a Grand Unified Theory of Mathematics</a></p>\n</li>\n<li><p><a class=\"post-section-overview\" href=\"#heading-a-final-lesson-from-history\">A Final Lesson From History</a></p>\n</li>\n</ul>\n<h2 id=\"heading-simple-analogy-the-tree-of-mathematics\">Simple Analogy: The Tree of Mathematics</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518175609/78838825-d872-42df-9dc8-736fa012a630.jpeg\" alt=\"Photo of two trees by Johannes Plenio: https://www.pexels.com/photo/two-brown-trees-1632790/\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>Imagine math as a vast tree growing forever.</p>\n<p>The roots of the tree are the foundations of mathematics: logic and set theory. From this foundation emerge the main basic fields of math: arithmetic, algebra, geometry, and analysis.</p>\n<p>As the tree divides further and further into more branches, new, more complex subfields start to appear, like topology, abstract algebra, and complex analysis. Sometimes the branches are connected to each other.</p>\n<p>And remember: this tree is always growing in many directions. From branches creating new branches to branches connecting to other branches. Little by little, it grows.</p>\n<p>Throughout history, there have been times that, due to some big scientific discoveries, parts of the math tree started to grow very fast. Other times, decades and even centuries passed without many new branches. This is the case for imaginary numbers, for example.</p>\n<p>And you might wonder: How many more branches and connections between them will keep appearing?</p>\n<h2 id=\"heading-the-structure-and-history-of-mathematics\">The Structure and History of Mathematics</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518363058/9911acd4-ad4f-4da2-a62b-9fa87e219c35.jpeg\" alt=\"Photo of a writing desk and notebook on Pixabay: https://www.pexels.com/photo/brown-wooden-desk-159618/\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>The first mathematical ideas appeared independently across ancient civilizations. For example:</p>\n<ul>\n<li><p>India’s invention of zero</p>\n</li>\n<li><p>Islamic algebraic advances</p>\n</li>\n<li><p>Greek geometric rigor</p>\n</li>\n</ul>\n<p>Over time, many different great mathematicians created and shared them by writing and giving lectures.</p>\n<p>Eventually, these new ideas were shared widely with new generations and these new generations created new math based on old math.</p>\n<p>This is is how new branches are continuously born from previous branches of the tree of mathematics.</p>\n<p>And this is why Isaac Newton wrote, in a letter to Robert Hooke in 1675:</p>\n<blockquote>\n<p>If I have seen further, it is by standing on the shoulders of giants</p>\n</blockquote>\n<p>He meant that by working from previous knowledge, he was able to create and (re)discover new ideas.</p>\n<p>Yet, the real power of math lies in practicing it over and over and understanding it more and more deeply. As one of my professors once explained:</p>\n<blockquote>\n<p><em>More important than knowing the theorems is knowing the ideas behind them and the history of how they were created.</em></p>\n</blockquote>\n<p>Very often, to solve problems, it is necessary to think in terms of first principles and build from there. Math teaches exactly that. In this way, math is not just an academic subject. It is a language spoken by scientists and engineers around the globe.</p>\n<p>By having it well preserved and shared, it is still possible to create new math from previous ideas. And it’s possible for the big tree to continue growing based on previous branches or nodes.</p>\n<h2 id=\"heading-an-tree-example-foundations-of-relativity-by-albert-einstein\">An Tree example: Foundations of Relativity by Albert Einstein</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518865627/e84ff108-b383-405b-8bb0-73ffb50b4dcf.jpeg\" alt=\"Albert Einstein, one of the greatest physics giants in history\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>Albert Einstein created the general and special theories of relativity. These have big consequences nowadays:</p>\n<ul>\n<li><p>GPS and Global Communication</p>\n</li>\n<li><p>Advancements in Satellite Telecommunications</p>\n</li>\n<li><p>Space Exploration and Satellite Launches</p>\n</li>\n</ul>\n<p>But this was only possible through the unification of geometry with calculus, called <strong>differential geometry.</strong> The evolution of differential geometry happened over the centuries, thanks to many great mathematicians. Below are some of them, but this is not a complete list:</p>\n<ul>\n<li><p><strong>Euclid (circa 300 BCE):</strong> Contributed to geometry, laying the groundwork for later mathematical systems</p>\n</li>\n<li><p><strong>Archimedes (circa 287–212 BCE):</strong> Pioneered the understanding of volume, surface area, and the principles of mechanics</p>\n</li>\n<li><p><strong>René Descartes (1596–1650):</strong> Developed Cartesian coordinates and analytical geometry</p>\n</li>\n<li><p><strong>Isaac Newton (1642–1727) &amp; Gottfried Wilhelm Leibniz (1646–1716):</strong> Newton’s laws of motion and gravitation, alongside Leibniz’s development of calculus, formed the basis of classical mechanics that Einstein sought to extend and modify in his theory of relativity.</p>\n</li>\n<li><p><strong>Leonhard Euler (1707–1783):</strong> Contributed to the development of differential equations, which are essential in the mathematical foundations of physics.</p>\n</li>\n<li><p><strong>Gaspard Monge (1746–1818):</strong> The father of differential geometry and pioneer in descriptive geometry</p>\n</li>\n<li><p><strong>Carl Friedrich Gauss (1777–1855):</strong> Made groundbreaking advances in geometry, including the concept of curved surfaces.</p>\n</li>\n<li><p><strong>Bernhard Riemann (1826–1866):</strong> Introduced Riemannian geometry, a branch of differential geometry.</p>\n</li>\n</ul>\n<p>Once again, as Isaac Newton wrote, in a letter to Robert Hooke in 1675:</p>\n<blockquote>\n<p>If I have seen further, it is by standing on the shoulders of giants.</p>\n</blockquote>\n<p>Albert Einstein saw what no one else in his time saw, thanks to these great math giants and countless others.</p>\n<h2 id=\"heading-the-biggest-paradox-of-math-discovered-by-kurt-godel\">The Biggest Paradox of Math, Discovered by Kurt Gödel</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518411126/df53f84c-f920-4b42-9081-5aeb1017f543.jpeg\" alt=\"Kurt Gödel, one of the greatest math giants in history\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>The biggest paradox in math, in my opinion, is what Kurt Gödel discovered. His early 20th century research revealed a limitation within this cycle.</p>\n<p>This paradox – that is, <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/G%C3%B6del%27s_incompleteness_theorems\">his incompleteness theorems</a> – shows that in any consistent formal system capable of expressing simple arithmetic, there will always be true mathematical statements that cannot be proven within the system itself.</p>\n<p>This means that in ALL systems, there are limits to what you can actually prove as to what is true and false. For for mathematicians, this means that the tree will never be completed. There are truths that are beyond formal truths, and yet we still assume that they are true (albeit unproven).</p>\n<p>This way, it proves that no matter how many mathematicians work in the field or how much AI is used to find new mathematics, there will always exist limitations. Some things are impossible to prove that are true, and we just know that they are due to approximation estimations and other non logical exact methods.</p>\n<h2 id=\"heading-what-about-applied-math-and-engineering\">What About Applied Math and Engineering?</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518581076/606f3bce-d7db-4ac3-9322-833673a734b0.jpeg\" alt=\"Photo by JESHOOTS.com: https://www.pexels.com/photo/person-holding-a-chalk-in-front-of-the-chalk-board-714699/\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>Applied math and engineering involves interpreting the same pure math ideas in real-world scenarios. Actually, in many cases, it is the combination of many math ideas. Let’s consider some examples:</p>\n<p>Principal component analysis (PCA) is a widely used tool in data science. Yet, it is a mixture of linear algebra (in PCA, eigenvalues) with optimization (order eigenvalues that represent more data with less data) in order to make datasets shorter.</p>\n<p>In machine learning, logistic regression is a mixture of calculus with statistics and probability.</p>\n<p>In harmonic analysis, Laplace, Fourier, and Z-transforms are a way to see the same thing in a new domain to get new insights. In this case, integrals are used to make this mapping.</p>\n<p>In deep learning, neural networks are just many matrices multiplying and updating themselves that adapt to model a dataset representing a system. This optimization of matrix values happens with activation functions, a gradient descent-based optimization method (tells how much values need to change), and backpropagation (applies those alterations to all matrix values).</p>\n<p>I have actually written an article where I teach <a target=\"_blank\" href=\"https://www.freecodecamp.org/news/activation-functions-in-neural-networks/\">why activation functions are important</a> if you want to check it out.</p>\n<p>But the best example of this fusion of math with engineering is in <a target=\"_blank\" href=\"https://www.freecodecamp.org/news/basic-control-theory-with-python/\">control theory</a>.</p>\n<p>Control theory is the study of the architecture of systems. From trains to cars to airplanes, everything is based on control theory. It is everywhere in nearly all modern electronic devices. In electric circuits, control theory is also used heavily to guarantee circuit stability in the face of electric disturbances.</p>\n<p>So as you can probably start to see, many of the tools we now have are just a mixture of many pure math ideas. Just many combinations and recipes of pure math ideas. In essence, applied math is the application of pure math as “ingredients“ in \"recipes\" to solve problems.</p>\n<p>So, we’ve explored the structure and evolution of mathematics. Yet, it is important to see how these ideas can be applied in real life. Pure math makes the framework, and applied math applies that framework to solve problems. To understand this, we’ll examine two code examples that show how you can use math ideas as programming tools.</p>\n<h2 id=\"heading-code-examples-analytical-and-numerical-approaches\">Code Examples – Analytical and Numerical Approaches</h2>\n<p>These code examples demonstrate a couple ways you can use Python to solve math equations.</p>\n<p>In the first code example, we’ll solve the problem in the same way that kids in school solve math exercises: essentially, by hand with a pencil. Moving variables from left to right to find their values. In the second example, we’ll solve the problem using numerical analysis.</p>\n<h3 id=\"heading-example-1-solve-a-problem-analytically\">Example 1: Solve a Problem Analytically</h3>\n<p>When we solve math problems analytically, like we did in school, we are manipulating symbols to get exact values. Often there symbols are x, y and z. In Python, we can do this using the SymPy library:</p>\n<pre><code class=\"lang-python\"><span class=\"hljs-keyword\">from</span> sympy <span class=\"hljs-keyword\">import</span> symbols, Eq, solve\n\nx, y = symbols(<span class=\"hljs-string\">'x y'</span>)\neq1 = Eq(<span class=\"hljs-number\">2</span>*x + <span class=\"hljs-number\">3</span>*y, <span class=\"hljs-number\">6</span>)\neq2 = Eq(-x + y, <span class=\"hljs-number\">1</span>)\n\nsolution = solve((eq1, eq2), (x, y))\nprint(solution)\n</code></pre>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747160359386/7a21cddc-f4ba-4f9f-afa0-d1cc11fb27d6.png\" alt=\"7a21cddc-f4ba-4f9f-afa0-d1cc11fb27d6\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>Essentially, we are finding x and y based on this equation:</p>\n<p>$$\\begin{align*} 2x + 3y &amp;= 6 \\\\ -x + y &amp;= 1 \\end{align*}$$</p><p>Which gives us the following result:</p>\n<pre><code class=\"lang-python\">{x: <span class=\"hljs-number\">3</span>/<span class=\"hljs-number\">5</span>, y: <span class=\"hljs-number\">8</span>/<span class=\"hljs-number\">5</span>}\n</code></pre>\n<p>Or:</p>\n<ul>\n<li><p>x= 0.6</p>\n</li>\n<li><p>y = 1.6</p>\n</li>\n</ul>\n<p>When we say that we’re solving this analytically, it means that we’re finding an exact mathematical solution using formulas or equations.</p>\n<p>But many times, problems are harder and can be solved by adding symbols to the right or left of the equation.</p>\n<p>Sometimes, there can be so many symbols and transformed versions of them, with things like derivatives and integrals, that it can become very hard to manage and takes a lot of time.</p>\n<p>For this reason, there is an area of mathematics devoted to finding approximations of already created mathematical formulas called numerical analysis. It makes it faster to solve these problems. And this is the method we will explore next.</p>\n<h3 id=\"heading-example-2-solve-numerically-approximation\">Example 2: Solve Numerically (Approximation)</h3>\n<p>We’ll now use SciPy to solve the same system with numerical methods:</p>\n<pre><code class=\"lang-python\"><span class=\"hljs-keyword\">import</span> numpy <span class=\"hljs-keyword\">as</span> np\n<span class=\"hljs-keyword\">from</span> scipy.linalg <span class=\"hljs-keyword\">import</span> solve\n\nA = np.array([[<span class=\"hljs-number\">3</span>, <span class=\"hljs-number\">2</span>, <span class=\"hljs-number\">-1</span>, <span class=\"hljs-number\">4</span>, <span class=\"hljs-number\">5</span>],\n              [<span class=\"hljs-number\">1</span>, <span class=\"hljs-number\">1</span>, <span class=\"hljs-number\">3</span>, <span class=\"hljs-number\">2</span>, <span class=\"hljs-number\">-2</span>],\n              [<span class=\"hljs-number\">4</span>, <span class=\"hljs-number\">-1</span>, <span class=\"hljs-number\">2</span>, <span class=\"hljs-number\">1</span>, <span class=\"hljs-number\">0</span>],\n              [<span class=\"hljs-number\">5</span>, <span class=\"hljs-number\">3</span>, <span class=\"hljs-number\">-2</span>, <span class=\"hljs-number\">1</span>, <span class=\"hljs-number\">1</span>],\n              [<span class=\"hljs-number\">2</span>, <span class=\"hljs-number\">-3</span>, <span class=\"hljs-number\">1</span>, <span class=\"hljs-number\">3</span>, <span class=\"hljs-number\">4</span>]])\n\nb = np.array([<span class=\"hljs-number\">12</span>, <span class=\"hljs-number\">5</span>, <span class=\"hljs-number\">7</span>, <span class=\"hljs-number\">9</span>, <span class=\"hljs-number\">10</span>])\n\nsolution = solve(A, b)\n\nprint(solution)\n</code></pre>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747160347486/d1f17aa6-b288-4e41-9be7-0810c45e778c.png\" alt=\"d1f17aa6-b288-4e41-9be7-0810c45e778c\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>In this code example, this line of code:</p>\n<pre><code class=\"lang-python\">solution = solve(A, b)\n</code></pre>\n<p>Uses the <a target=\"_blank\" href=\"https://docs.scipy.org/doc/scipy/reference/generated/scipy.linalg.solve.html\">solve</a> method from the <a target=\"_blank\" href=\"https://scipy.org/\">SciPy</a> Python library:</p>\n<pre><code class=\"lang-python\"><span class=\"hljs-keyword\">from</span> scipy.linalg <span class=\"hljs-keyword\">import</span> solve\n</code></pre>\n<p>It’s a method that helps you find the values of x in an equation A⋅x=b, where a is a square grid of numbers and b is a list of numbers. Which gives us the following:</p>\n<pre><code class=\"lang-python\">[ <span class=\"hljs-number\">1.35022026</span> <span class=\"hljs-number\">-0.79955947</span> <span class=\"hljs-number\">-1.17180617</span>  <span class=\"hljs-number\">3.14317181</span> <span class=\"hljs-number\">-0.83920705</span>]\n</code></pre>\n<p>Now imagine, in this simple case, that a matrix like A could represent the <strong>traffic flow</strong> between cities or intersections, and b could represent the <strong>traffic entering or leaving</strong> each city.</p>\n<p>By solving the system, it could help us determine the distribution of traffic between cities to meet desired traffic conditions.</p>\n<p>Of course, these types of problems are far more complex in real life. But to understand and solve the big problems, you need to first understand the smaller problems.</p>\n<p>And by the way, a system of equations is the same thing as a matrix. We just represent systems of equations as matrices to make the findings of properties and clarity easier to understand.</p>\n<p>The thing is that by using matrices, it is easier to make calculations and to perform linear algebra math to check for characteristics of the matrix and understand it better.</p>\n<p>In essence, a matrix represents a system of equations. Also, systems of equations can represent real life phenomena like the economy of a country or the weather.</p>\n<p>If you want to know more, I wrote an <a target=\"_blank\" href=\"https://www.freecodecamp.org/news/numerical-analysis-explained-how-to-apply-math-with-python/\">entire article on numerical analysis</a> that you can check out.</p>\n<h2 id=\"heading-the-impact-of-a-grand-unified-theory-of-mathematics\">The Impact of a Grand Unified Theory of Mathematics</h2>\n<p><img src=\"https://cdn.hashnode.com/res/hashnode/image/upload/v1747518681068/54a9556c-2a79-441c-a6d6-27ff38e1f4ff.jpeg\" alt=\"Photo by Porapak Apichodilok: https://www.pexels.com/photo/person-holding-world-globe-facing-mountain-346885/\" class=\"image--center mx-auto\" width=\"600\" height=\"400\" loading=\"lazy\"></p>\n<p>Despite the biggest paradox in mathematics, what would happen with a <a target=\"_blank\" href=\"https://www.scientificamerican.com/article/the-evolving-quest-for-a-grand-unified-theory-of-mathematics/\">Grand Unified Theory of Mathematics</a>?</p>\n<p>Remember that such a theory tells us that there are things that are true that are impossible to formally prove, and we need to just accept it. But even with this assumption, it is still possible to unify all math.</p>\n<p>This is what <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Langlands_program\">the Langland's program</a> is trying to solve. A kind of attempt to interconnect the largest parts of the big tree of math to uncover new patterns in math.</p>\n<p>With a Grand Unified Theory of Mathematics, we would be able to understand how every branch of the tree connects with the others and all the relationships between them.</p>\n<h3 id=\"heading-what-is-the-value-of-this-big-unification-for-society\">What is the value of this big unification for society?</h3>\n<p>By studying history, we can find patterns. The unification of various fields has created many massive impacts on society, such as:</p>\n<ul>\n<li><p>In the 19th century, James Clerk Maxwell united the fields of <em>electricity</em> and <em>magnetism</em> with his famous Maxwell equations. This allowed the creation of radios and electric grids around the globe. In turn, it served as a foundation for all technological progress in the 20th and 21th century.</p>\n</li>\n<li><p>In the 20th century, the unification of <em>algebra</em> with <em>logic</em> led to the rise of digital systems. In turn, digital systems gave the rise of processors and the evolution of computers to the modern laptop.</p>\n</li>\n<li><p>Also in the 20th century, the unification of <em>probability</em> and <em>communication</em> led to information theory. This became the foundation for the internet. This unification was carried out by a great mathematician called Clause Shannon.</p>\n</li>\n</ul>\n<p>In the end, a Grand Unified Theory of Mathematics could be one of the biggest achievements in modern society.</p>\n<p>It could lead to new discoveries in physics, such as in string theory or quantum gravity, where deep mathematical structures are needed to create new physics. In AI, it could help unify all machine learning models in a common architecture. This would help accelerate the development of new AI models. It could also open the door to new cryptographic methods and material science advances, revealing, with math, the deep patterns still not found in these fields.</p>\n<p>Just as uniting electricity and magnetism led to modern technology, a unified math framework would lead to a wave of innovation.</p>\n<h2 id=\"heading-a-final-lesson-from-history\">A Final Lesson From History</h2>\n<p>From Greek geometry to AI, math has grown like a tree over centuries. By understanding its structure, it is possible to see its role in finding the patterns of our universe. I hope I was able to make you see math in this way.</p>\n<p>In addition, we can conclude that the unification of scientific fields makes the foundations for the creation of new innovations to help society go forward. Many profound societal transformations only came to be thanks to abstract math ideas. When these are shared and refined, they become the hidden architecture of progress in society. Innovation begins when disconnected ideas are united, well-linked, and widely shared.</p>\n<p>Find the full code <a target=\"_blank\" href=\"https://github.com/tiagomonteiro0715/freecodecamp-my-articles-source-code\">here</a>.</p>\n \n                ",
        "type": "text/vnd.tiddlywiki",
        "link": "https://www.freecodecamp.org/news/the-architecture-of-mathematics-and-how-developers-can-use-it-in-code/"
    }
]